In [4]:
import pandas as pd

In [13]:
file = pd.read_csv('input/Python Skill Development Programme Registration FINAL.csv')

In [14]:
type(file)

pandas.core.frame.DataFrame

In [15]:
file.head(5)

,Timestamp,Name,AOT Mail Address,Phone Number,Year,Department,Languages known
0,2018/01/11 9:59:46 PM GMT+5:30,Aayush jha,NaN,NaN,1st,IT,NaN
1,2018/01/12 7:25:38 AM GMT+5:30,Abhay sharma,NaN,NaN,1st,ECE,Java
2,2018/01/16 9:36:30 AM GMT+5:30,Abhinav Jain,NaN,NaN,1st,CSE,C++
3,2018/01/11 10:01:25 PM GMT+5:30,Abhirup Dey,NaN,NaN,2nd,EE,C
4,2018/01/14 11:40:20 PM GMT+5:30,Abhishek Chatterjee,NaN,NaN,3rd,ECE,C

In [16]:
file['Year'] = file['Year'].apply(lambda y: int(y[0]));

In [17]:
file.head(5)

,Timestamp,Name,AOT Mail Address,Phone Number,Year,Department,Languages known
0,2018/01/11 9:59:46 PM GMT+5:30,Aayush jha,NaN,NaN,1,IT,NaN
1,2018/01/12 7:25:38 AM GMT+5:30,Abhay sharma,NaN,NaN,1,ECE,Java
2,2018/01/16 9:36:30 AM GMT+5:30,Abhinav Jain,NaN,NaN,1,CSE,C++
3,2018/01/11 10:01:25 PM GMT+5:30,Abhirup Dey,NaN,NaN,2,EE,C
4,2018/01/14 11:40:20 PM GMT+5:30,Abhishek Chatterjee,NaN,NaN,3,ECE,C

In [18]:
depts = ['CSE', 'IT', 'ECE', 'EIE', 'EE', 'ME', 'MCA']
years = 4

In [19]:
output_dfs = [
    [
        (
            "Year {i}: {dept}".format(i=i+1, dept=dept),
            file[(file['Year'] == i+1) & (file['Department'] == dept)]
        )
        for dept in depts
    ]
    for i in range(years)
]

In [20]:
print(output_dfs[0][0][0])
output_dfs[0][0][1].head(5)

Year 1: CSE

,Timestamp,Name,AOT Mail Address,Phone Number,Year,Department,Languages known
2,2018/01/16 9:36:30 AM GMT+5:30,Abhinav Jain,NaN,NaN,1,CSE,C++
6,2018/01/12 10:48:03 PM GMT+5:30,Abhishek Singh,NaN,NaN,1,CSE,NaN
16,2018/01/11 9:57:43 PM GMT+5:30,Akash Munshi,NaN,NaN,1,CSE,Python;Java
47,2018/01/11 9:55:51 PM GMT+5:30,Ankit Saha,NaN,NaN,1,CSE,Java;JavaScript;PHP;Arduino
58,2018/01/12 3:35:04 PM GMT+5:30,Archika Nandi,NaN,NaN,1,CSE,C++

In [21]:
print(output_dfs[0][1][0])
output_dfs[0][1][1].head(5)

Year 1: IT

,Timestamp,Name,AOT Mail Address,Phone Number,Year,Department,Languages known
0,2018/01/11 9:59:46 PM GMT+5:30,Aayush jha,NaN,NaN,1,IT,NaN
12,2018/01/14 10:50:52 PM GMT+5:30,Adityakash singh,NaN,NaN,1,IT,C
18,2018/01/15 10:41:29 PM GMT+5:30,AKHILBARAN GHOSH,NaN,NaN,1,IT,Java;C;C++
29,2018/01/14 6:10:54 PM GMT+5:30,ANAND KUMAR GUPTA,NaN,NaN,1,IT,C;C++
30,2018/01/17 10:46:32 AM GMT+5:30,Ananya Das,NaN,NaN,1,IT,C;C++

In [22]:
print(output_dfs[1][0][0])
output_dfs[1][0][1].head(5)

Year 2: CSE

,Timestamp,Name,AOT Mail Address,Phone Number,Year,Department,Languages known
14,2018/01/17 6:50:27 PM GMT+5:30,Akash Das,NaN,NaN,2,CSE,C
15,2018/01/14 9:26:30 PM GMT+5:30,AKASH DEY,NaN,NaN,2,CSE,Java;C;C++
19,2018/01/12 6:18:04 PM GMT+5:30,Aman Kumar soni,NaN,NaN,2,CSE,C
22,2018/01/12 2:22:47 PM GMT+5:30,amit kumar mitra,NaN,NaN,2,CSE,C
35,2018/01/15 8:23:16 PM GMT+5:30,Anindya Chatterjee,NaN,NaN,2,CSE,C